var a = ['Австралия', 'Австрия', 'Азербайджан', 'Албания', 'Алжир', 'Ангилья', 'Ангола', 'Андорра', 'Антарктика', 'Антигуа и Барбуда', 'Антильские острова (Нидерландские Антилы)', 'Аомынь (Макао)', 'Аргентина', 'Армения', 'Аруба', 'Афганистан', 'Багамы', 'Бангладеш', 'Барбадос', 'Бахрейн', 'Белиз', 'Беларусь', 'Бельгия', 'Бенин', 'Бермуды', 'Болгария', 'Боливия', 'Босния и Герцеговина', 'Ботсвана', 'Бразилия', 'Британская территория в Индийском океане', 'Бруней-Даруссалам', 'Буве, остров', 'Буркина-Фасо', 'Бурунди', 'Бутан', 'Вануату', 'Ватикан', 'Великобритания (Соединённое Королевство)', 'Венгрия', 'Венесуэла', 'Виргинские острова (Британские)', 'Виргинские острова (США)', 'Восточное Самоа', 'Восточный Тимор', 'Вьетнам', 'Габон', 'Гаити', 'Гайана', 'Гамбия', 'Гана', 'Гваделупа', 'Гватемала', 'Гвиана Французская', 'Гвинея', 'Гвинея-Бисау', 'Германия', 'Гибралтар', 'Гондурас', 'Гонконг', 'Гренада', 'Гренландия', 'Греция', 'Грузия', 'Гуам', 'Дания', 'Джибути', 'Доминика', 'Доминиканская Республика', 'Египет', 'Замбия', 'Западная Сахара', 'Зимбабве', 'Израиль', 'Индия', 'Индонезия', 'Иордания', 'Ирак', 'Иран', 'Ирландия', 'Исландия', 'Испания', 'Италия', 'Йемен', 'Кабо-Верде', 'Казахстан', 'Кайман, острова', 'Камбоджа', 'Камерун', 'Канада', 'Катар', 'Кения', 'Кипр', 'Кирибати', 'Китай', 'Кокосовые (Килинг) острова', 'Колумбия', 'Коморы', 'Конго (Браззавиль)', 'Конго (Киншаса)', 'Корейская Народно-Демократическая Республика', 'Корея, Республика', 'Коста-Рика', 'Кот-д’Ивуар', 'Куба', 'Кувейт', 'острова Кука', 'Кыргызстан (Киргизия)', 'Лаос', 'Латвия', 'Лесото', 'Либерия', 'Ливан', 'Ливийская Арабская Джамахирия (Ливия)', 'Литва', 'Лихтенштейн', 'Люксембург', 'Маврикий', 'Мавритания', 'Мадагаскар', 'Македония', 'Малави', 'Малайзия', 'Мали', 'Мальдивы', 'Мальта', 'Маоре (Майотта)', 'Марокко', 'Мартиника', 'Маршалловы острова', 'Мексика', 'Микронезия (Федеративные Штаты Микронезии)', 'Мозамбик', 'Молдова (Республика Молдова)', 'Монако', 'Монголия', 'Монтсеррат', 'Мьянма', 'Намибия', 'Науру', 'Непал', 'Нигер', 'Нигерия', 'Нидерланды', 'Никарагуа', 'Ниуэ', 'Новая Зеландия', 'Новая Каледония', 'Норвегия', 'Норфолк, остров', 'Объединённые Арабские Эмираты', 'Оман', 'Остров Рождества', 'Пакистан', 'Палау', 'Панама', 'Папуа-Новая Гвинея', 'Парагвай', 'Перу', 'Питкэрн', 'Польша', 'Португалия', 'Пуэрто-Рико', 'Реюньон', 'Россия (Российская Федерация)', 'Руанда', 'Румыния', 'Сальвадор', 'Самоа', 'Сан-Марино', 'Сан-Томе и Принсипи', 'Саудовская Аравия', 'Свазиленд', 'Свальбард (Шпицберген) и Ян-Майен', 'Святая Елена', 'Северные Марианские острова', 'Сейшелы', 'Сен-Пьер и Микелон', 'Сенегал', 'Сент-Винсент и Гренадины', 'Сент-Китс и Невис', 'Сент-Люсия', 'Сингапур	', 'Сирия', 'Словакия', 'Словения', 'Соединённые Штаты Америки (США)', 'Соломоновы Острова', 'Сомали', 'Судан', 'Суринам', 'Сьерра-Леоне', 'Таджикистан', 'Таиланд', 'Тайвань, провинция Китая', 'Танзания', 'Тёркс и Кайкос', 'Того', 'Токелау', 'Тонга', 'Тринидад и Тобаго', 'Тувалу', 'Тунис', 'Туркменистан', 'Турция', 'Уганда', 'Узбекистан', 'Узбекистан', 'Узбекистан', 'Уругвай', 'Фарерские острова', 'Фиджи', 'Филиппины', 'Финляндия', 'Фолклендские (Мальвинские) острова', 'Франция', 'Франция, Метрополия', 'Французская Полинезия', 'Французские Южные территории', 'Херд и Макдональд, острова', 'Хорватия', 'Центрально-Африканская Республика', 'Чад', 'Чехия', 'Чили', 'Швейцария', 'Швеция', 'Шри-Ланка', 'Эквадор', 'Экваториальная Гвинея', 'Эритрея', 'Эстония', 'Эфиопия', 'Югославия', 'Южная Георгия и Южные Сандвичевы острова', 'Южно-Африканская Республика', 'Ямайка', 'Япония'];

var en = ['Abkhazia','Afghanistan','Albania','Algeria','Argentina','Armenia','Australia','Austria','Azerbaijan','Bahamas','Bahrain','Bangladesh','Belarus','Belgium','Bermuda Islands','Bolivia','Brazil','Bulgaria','Burundi','Cambodia','Cameroon','Canada','Chile','China','Colombia','Congo','Costa Rica','Cuba','Cyprus','Czech Republic','Denmark','Dominican Republic','Ecuador','Egypt','El Salvador','Estonia','Ethiopia','Finland','France','Georgia','Germany','Ghana','Gibraltar','United Kingdom','Greece','Guatemala','Guinea','Haiti','Hawaii','Honduras','Hong Kong','Hungary','Iceland','India','Indonesia','Iran','Iraq','Ireland','Israel','Italy','Ivory Coast','Jamaica','Japan','Kazakhstan','Kenya','Kuwait','Kyrgyzstan','Latvia','Lebanon','Liberia','Libya','Lithuania','Luxemburg','Madagascar','Malawi','Malaysia','Malta','Mexico','Moldova','Monaco','Mongolia','Morocco','Nepal','Netherlands','New Zeland','Nicaragua','Nigeria','North Korea','Norway','Oman','Pakistan','Panama','Papua New Guinea','Paraguay','Peru','Philippines','Poland','Portugal','Puerto Rico','Romania','Russia','Rwanda','Saudi Arabia','Senegal','Sierra Leone','Singapore','Slovakia','Slovenia','South Africa','South Korea','South Ossetia','Spain','Sri Lanka','Sudan','Sweden','Switzerland','Syria','Taiwan','Tajikistan','Thailand','Togo','Tunisia','Turkey','Turkmenistan','Uganda','Ukraine','United Arab Emirates','United States of America','Uruguay','Uzbekistan','Venezuela','Yemen','Zaire','Zambia','Zimbabwe'];

var b = [];
var i = 0;

$('#list').hide();

$.each(a, function(i){
	$('<option value="'+a[i]+'">').appendTo('#a');
  b[i] = '<div class="list '+i+'">'+a[i]+'</div>';
  /* второй класс для уникального id, иначе не будет
  показывать значение нажатого div */
});
$('#list').html(b);

$('[list="a"]').focus(function(){
	$('[list="a"]').val('');
});

$('.list').click(function(){
	$('[list=a]').val($(this).html());
  turn();
});

function turn(){
	$('.array').html('▼');
  $('#list').slideUp(200);
  i = 0;
};

$('.array').click(function(){
	if(i==0){
		$(this).html('▲');
    $('#list').slideDown(200);
    i = 1;
  } else {
  	turn();
  };
});

$.each(en, function(i){
	$('<option value="'+en[i]+'">').appendTo('#en');
  b[i] = '<div class="list '+i+'">'+en[i]+'</div>';
  /* второй класс для уникального id, иначе не будет
  показывать значение нажатого div */
});
$('#list').html(b);

$('[list="en"]').focus(function(){
	$('[list="en"]').val('');
});

$('.list').click(function(){
	$('[list=en]').val($(this).html());
  turn();
});

function turn(){
	$('.array').html('▼');
  $('#list').slideUp(200);
  i = 0;
};

$('.array').click(function(){
	if(i==0){
		$(this).html('▲');
    $('#list').slideDown(200);
    i = 1;
  } else {
  	turn();
  };
});
